In [86]:
import pandas as pd
import numpy as np

In [232]:
d1 = {'Name': ['Pankaj', 'Meghna', 'David'], 'ID': [1, 2, 3], 'Role': ['CEO', 'CTO', 'Editor']}

source_df = pd.DataFrame(d1)

print(source_df)

     Name  ID    Role
0  Pankaj   1     CEO
1  Meghna   2     CTO
2   David   3  Editor

In [231]:
raw_data = {'first_name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', np.nan, np.nan, 'Milner', 'Cooze'], 
        'age': [22, np.nan, 23, 24, 25], 
        'sex': ['m', np.nan, 'f', 'm', 'f'], 
        'Test1_Score': [4, np.nan, 0, 0, 0],
        'Test2_Score': [25, np.nan, np.nan, 0, 0]}
results = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'sex', 'Test1_Score', 'Test2_Score'])


results

  first_name last_name   age  sex  Test1_Score  Test2_Score
0      Jason    Miller  22.0    m          4.0         25.0
1        NaN       NaN   NaN  NaN          NaN          NaN
2       Tina       NaN  23.0    f          0.0          NaN
3       Jake    Milner  24.0    m          0.0          0.0
4        Amy     Cooze  25.0    f          0.0          0.0

In [210]:
results.shape

(5, 6)

In [227]:
class dropColumns(object):
    def removeColByName(self,source_df,colName):
        source_df.drop(columns=colName,axis=1,inplace =True)
        return source_df
    def removeMultipleColsByName(self,source_df,colName):
        source_df.drop(columns=colName,axis=1,inplace =True)
        return source_df
    def removeSingleColByIndex(self,source_df,indexNum):
        source_df.drop(source_df.columns[[indexNum]],inplace =True,axis = 1)
        return source_df
    def removeMultiColByIndex(self,source_df,indexNum):
        source_df.drop(source_df.columns[[indexNum]],inplace =True,axis = 1)
        return source_df
    def removeColumnsHavingNulls(self,source_df,thresholdVal=0.95):
        null_percentage = source_df.isnull().sum()/source_df.shape[0]
        col_to_drop = null_percentage[null_percentage>=thresholdVal].keys()
        output_df = source_df.drop(col_to_drop, axis=1)
        return output_df

In [228]:
obj = dropColumns()

In [235]:
obj.removeMultiColByIndex (source_df,[0,1])

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [230]:
obj.removeMultipleColsByName(source_df, ['ID','Role'])

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [220]:
results.shape

(5, 6)

In [221]:
afterdf = obj.removeColumnsHavingNulls(results,thresholdVal = 0.2)

In [223]:
afterdf.shape

(5, 0)

In [217]:
def missing_zero_values_table(df):
        mis_val = df.isnull().sum()
        mis_val_percent = 100 * df.isnull().sum() / len(df)
        mz_table = pd.concat([mis_val, mis_val_percent], axis=1)
        mz_table = mz_table.rename(
        columns = {0 : 'Missing Values', 1 : '% of Total Values'})
        mz_table['Data Type'] = df.dtypes
        return mz_table

missing_zero_values_table(results)

             Missing Values  % of Total Values Data Type
first_name                1               20.0    object
last_name                 2               40.0    object
age                       1               20.0   float64
sex                       1               20.0    object
Test1_Score               1               20.0   float64
Test2_Score               2               40.0   float64

In [ ]:
## Test it throughly.....